app/views/users/index.html.erb

SELECT "users".* FROM "users"
---
  <ul class="listing">
    <% @users = User.all %>