app/views/users/show.html.erb

SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 8]]
SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 8]]
---
</p>
<p>Number of my posts: <%= link_to @user.posts.count  %></p>