app/controllers/news_pages_controller.rb

SELECT  "news_pages".* FROM "news_pages"  ORDER BY created_at DESC LIMIT 6 OFFSET 0
SELECT COUNT(*) FROM "news_pages"
---
  def index
    @news_pages = NewsPage.all.order("created_at DESC").paginate(page: params[:page], per_page: 6)

INSERT INTO "news_pages" ("title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "This is News"], ["content", "kwdkflkf"], ["created_at", "2016-06-04 14:45:08.782195"], ["updated_at", "2016-06-04 14:45:08.782195"]]
---
  def create
    @news_page = NewsPage.new(news_page_params)

    respond_to do |format|
      if @news_page.save

UPDATE "news_pages" SET "image_file_name" = ?, "image_content_type" = ?, "image_file_size" = ?, "image_updated_at" = ?, "updated_at" = ? WHERE "news_pages"."id" = ?
---
  def update
    respond_to do |format|
      if @news_page.update(news_page_params)

SELECT  "news_pages".* FROM "news_pages" WHERE "news_pages"."id" = ? LIMIT 1  [["id", 5]]
---
    def set_news_page
      @news_page = NewsPage.find(params[:id])