app/controllers/posts_controller.rb

  def index
    @posts = Post.all.order("created_at DESC").paginate(page: params[:page], per_page: 3)
---
SELECT "posts".* FROM "posts"  ORDER BY created_at DESC
SELECT COUNT(*) FROM "posts"

  def create
    @topic = Topic.find(params[:topic_id])
    @post = @topic.posts.create(post_params)
---
INSERT INTO "posts" ("title", "text", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "xcsvsdbdfbfs"], ["text", "vsd .snvlksv;eb;bk"], ["user_id", 4], ["created_at", "2016-06-02 01:24:11.561368"], ["updated_at", "2016-06-02 01:24:11.561368"]]

  def update
    @topic = Topic.find(params[:topic_id])
    @post = @topic.posts.find(params[:id])

    if @post.update(post_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 4]]
UPDATE "posts" SET "title" = ?, "text" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "HeloO"], ["text", "xm,c. /k,/aKA KDKODK\r\n"], ["updated_at", "2016-05-31 03:15:47.609811"], ["id", 4]]

   def edit
    @topic = Topic.find(params[:topic_id])
    @post = @topic.posts.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]

  def destroy

    @post = Topic.posts.find(params[:id])
    @post.destroy
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 5]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 5]]