app/controllers/users_controller.rb

UPDATE "users" SET "first_name" = ?, "last_name" = ?, "age" = ?, "email" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["first_name", "Alisher"], ["last_name", "Musurmonov"], ["age", 26], ["email", "alisher.musurmonov89@gmail.com"], ["updated_at", "2016-06-02 12:46:33.807463"], ["id", 5]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)